<a href="https://colab.research.google.com/github/javilledo/machine-learning/blob/master/notebooks/t02_02_data_cleaning_agrupacion_de_datos.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# AGREGACIÓN DE DATOS POR CATEGORÍA

In [1]:
import numpy as np
import pandas as pd

In [15]:
gender = ['Male', 'Female']
economic_status = ['Poor', 'Middle Class', 'Rich']

In [16]:
n = 500

gender_data = []
economic_status_data = []

for i in range(0,n):
  gender_data.append(np.random.choice(gender))
  economic_status_data.append(np.random.choice(economic_status))

In [12]:
gender_data[1:10]

['Male',
 'Female',
 'Female',
 'Female',
 'Male',
 'Male',
 'Female',
 'Male',
 'Female']

In [18]:
economic_status_data[1:10]

['Poor',
 'Rich',
 'Poor',
 'Middle Class',
 'Middle Class',
 'Poor',
 'Rich',
 'Rich',
 'Rich']

In [22]:
# N(m,s) = m + s * N(0,1)
height_data = 160 + 30 * np.random.randn(n)
weight_data = 65 + 25 * np.random.randn(n)
age_data = 30 + 12 * np.random.randn(n)
income_data = 18000 + 3500 * np.random.randn(n)

In [23]:
data = pd.DataFrame(
    {
        'Gender': gender_data,
        'Economic Status': economic_status_data,
        'Height': height_data,
        'Weight': weight_data,
        'Age': age_data,
        'Income': income_data      
    }
)
data.head()

   Gender Economic Status      Height     Weight        Age        Income
0  Female            Rich  198.548692  46.490290  48.524958  18819.451318
1  Female            Poor  224.158464  69.609020  29.878947  21913.819247
2  Female            Rich  192.079356  46.564588  21.135322  15167.714374
3    Male            Poor  139.625756  47.526876  41.235206  17112.665822
4    Male    Middle Class  242.785594  72.312758  34.381577  14182.630333

In [28]:
data['Age'] = [int(x) for x in data['Age']] #transformamos edad a entero
data.head()

   Gender Economic Status      Height     Weight  Age        Income
0  Female            Rich  198.548692  46.490290   48  18819.451318
1  Female            Poor  224.158464  69.609020   29  21913.819247
2  Female            Rich  192.079356  46.564588   21  15167.714374
3    Male            Poor  139.625756  47.526876   41  17112.665822
4    Male    Middle Class  242.785594  72.312758   34  14182.630333

# AGRUPACIÓN DE DATOS

In [30]:
grouped_gender = data.groupby('Gender')

In [35]:
grouped_gender.groups

{'Female': Int64Index([  0,   1,   2,   6,   7,  10,  11,  12,  13,  15,
             ...
             480, 481, 485, 487, 490, 494, 495, 497, 498, 499],
            dtype='int64', length=259),
 'Male': Int64Index([  3,   4,   5,   8,   9,  14,  19,  22,  25,  31,
             ...
             482, 483, 484, 486, 488, 489, 491, 492, 493, 496],
            dtype='int64', length=241)}

In [36]:
grouped_gender.groups['Female']

Int64Index([  0,   1,   2,   6,   7,  10,  11,  12,  13,  15,
            ...
            480, 481, 485, 487, 490, 494, 495, 497, 498, 499],
           dtype='int64', length=259)

In [37]:
grouped_gender.groups['Female'].values

array([  0,   1,   2,   6,   7,  10,  11,  12,  13,  15,  16,  17,  18,
        20,  21,  23,  24,  26,  27,  28,  29,  30,  33,  34,  38,  40,
        41,  42,  43,  44,  46,  49,  58,  59,  62,  64,  65,  66,  67,
        68,  70,  72,  73,  77,  83,  84,  88,  89,  90,  91,  95,  99,
       101, 102, 103, 105, 108, 111, 115, 118, 119, 120, 121, 123, 124,
       125, 129, 131, 133, 138, 140, 141, 145, 147, 148, 150, 154, 155,
       158, 162, 163, 166, 167, 168, 170, 171, 172, 173, 174, 177, 178,
       182, 183, 184, 186, 192, 194, 195, 196, 198, 200, 201, 202, 204,
       207, 208, 211, 212, 214, 215, 216, 219, 227, 228, 232, 233, 237,
       238, 239, 242, 243, 246, 247, 248, 249, 250, 251, 255, 257, 261,
       265, 266, 267, 269, 272, 273, 274, 275, 279, 280, 281, 283, 285,
       288, 293, 296, 300, 301, 302, 304, 305, 307, 308, 309, 310, 314,
       316, 318, 321, 324, 325, 328, 330, 331, 333, 335, 336, 337, 340,
       341, 343, 345, 346, 349, 350, 353, 354, 356, 357, 359, 360, 361,
       363, 364, 365, 367, 368, 372, 373, 374, 375, 378, 380, 381, 384,
       386, 388, 391, 392, 393, 397, 398, 400, 403, 405, 408, 411, 413,
       414, 415, 416, 417, 419, 420, 421, 422, 426, 428, 429, 431, 432,
       433, 434, 435, 436, 439, 441, 443, 445, 446, 449, 450, 451, 454,
       458, 459, 465, 466, 467, 468, 469, 470, 472, 474, 475, 476, 477,
       478, 479, 480, 481, 485, 487, 490, 494, 495, 497, 498, 499])

In [38]:
for names, groups in grouped_gender:
  print(names)
  print(groups)

Female
     Gender Economic Status      Height      Weight  Age        Income
0    Female            Rich  198.548692   46.490290   48  18819.451318
1    Female            Poor  224.158464   69.609020   29  21913.819247
2    Female            Rich  192.079356   46.564588   21  15167.714374
6    Female            Poor  204.651296   70.274756   48  14901.359352
7    Female            Rich  136.325104   49.979898   26  14754.779316
..      ...             ...         ...         ...  ...           ...
494  Female    Middle Class  160.141805   91.923758   20  18116.548250
495  Female            Poor  147.208619   83.574194   35  14119.727622
497  Female    Middle Class  171.319370  101.754877   18  13363.487724
498  Female            Poor  181.911592   22.781463   13  16481.634007
499  Female    Middle Class  203.067105   75.328700   22  14254.529833

[259 rows x 6 columns]
Male
    Gender Economic Status      Height      Weight  Age        Income
3     Male            Poor  139.625756   47.526876   41  17112.665822
4     Male    Middle Class  242.785594   72.312758   34  14182.630333
5     Male    Middle Class  212.357599   61.578724   52  15700.149195
8     Male            Rich  151.220185   66.356876   20  13931.548978
9     Male            Rich  152.739256   72.220529   27  22820.255523
..     ...             ...         ...         ...  ...           ...
489   Male            Rich  189.571604   67.333214   38  17575.390642
491   Male            Rich  162.240592   96.059169   23  17531.218119
492   Male            Rich  199.114712   62.540256   24  14669.617357
493   Male            Rich  135.571083  126.362858   42  21270.658356
496   Male            Poor  123.539934   87.016845   64  18377.231521

[241 rows x 6 columns]

In [39]:
grouped_gender.get_group('Female')

     Gender Economic Status      Height      Weight  Age        Income
0    Female            Rich  198.548692   46.490290   48  18819.451318
1    Female            Poor  224.158464   69.609020   29  21913.819247
2    Female            Rich  192.079356   46.564588   21  15167.714374
6    Female            Poor  204.651296   70.274756   48  14901.359352
7    Female            Rich  136.325104   49.979898   26  14754.779316
..      ...             ...         ...         ...  ...           ...
494  Female    Middle Class  160.141805   91.923758   20  18116.548250
495  Female            Poor  147.208619   83.574194   35  14119.727622
497  Female    Middle Class  171.319370  101.754877   18  13363.487724
498  Female            Poor  181.911592   22.781463   13  16481.634007
499  Female    Middle Class  203.067105   75.328700   22  14254.529833

[259 rows x 6 columns]

In [40]:
data.groupby('Economic Status').get_group('Poor')

     Gender Economic Status      Height     Weight  Age        Income
1    Female            Poor  224.158464  69.609020   29  21913.819247
3      Male            Poor  139.625756  47.526876   41  17112.665822
6    Female            Poor  204.651296  70.274756   48  14901.359352
10   Female            Poor  175.420380  65.081808   19  18288.314936
15   Female            Poor  159.001900  29.689332   42  23092.499437
..      ...             ...         ...        ...  ...           ...
482    Male            Poor  189.903690  45.634899   25  23264.833944
484    Male            Poor  159.300407  77.675019   25  19133.911558
495  Female            Poor  147.208619  83.574194   35  14119.727622
496    Male            Poor  123.539934  87.016845   64  18377.231521
498  Female            Poor  181.911592  22.781463   13  16481.634007

[161 rows x 6 columns]

In [41]:
double_group = data.groupby(['Gender', 'Economic Status'])

In [42]:
len(double_group)

6

In [43]:
for names, groups in double_group:
  print(names)
  print(groups)

('Female', 'Middle Class')
     Gender Economic Status      Height      Weight  Age        Income
13   Female    Middle Class  191.726445   42.164465   22  19713.818444
26   Female    Middle Class  190.610956   75.798465   18  21705.137631
29   Female    Middle Class  185.335032   42.889602   26  14407.702488
34   Female    Middle Class  184.523258  106.390881   26  14289.217826
41   Female    Middle Class  170.300684   96.188690    5  20697.787818
..      ...             ...         ...         ...  ...           ...
485  Female    Middle Class  125.523790   42.412917   33  20118.465360
490  Female    Middle Class  242.269762   88.456508   29  13300.729401
494  Female    Middle Class  160.141805   91.923758   20  18116.548250
497  Female    Middle Class  171.319370  101.754877   18  13363.487724
499  Female    Middle Class  203.067105   75.328700   22  14254.529833

[89 rows x 6 columns]
('Female', 'Poor')
     Gender Economic Status      Height     Weight  Age        Income
1    Female            Poor  224.158464  69.609020   29  21913.819247
6    Female            Poor  204.651296  70.274756   48  14901.359352
10   Female            Poor  175.420380  65.081808   19  18288.314936
15   Female            Poor  159.001900  29.689332   42  23092.499437
16   Female            Poor  111.322730  90.616988   38  13816.470173
..      ...             ...         ...        ...  ...           ...
477  Female            Poor  130.743525  77.383391   54  21691.265814
478  Female            Poor  144.163286  80.514828   18  17800.279919
480  Female            Poor  147.081039  73.791823   62  18038.150724
495  Female            Poor  147.208619  83.574194   35  14119.727622
498  Female            Poor  181.911592  22.781463   13  16481.634007

[91 rows x 6 columns]
('Female', 'Rich')
     Gender Economic Status      Height     Weight  Age        Income
0    Female            Rich  198.548692  46.490290   48  18819.451318
2    Female            Rich  192.079356  46.564588   21  15167.714374
7    Female            Rich  136.325104  49.979898   26  14754.779316
11   Female            Rich  174.036891  63.107930   41  23725.653175
12   Female            Rich  139.824140  77.477363   36  26828.191953
..      ...             ...         ...        ...  ...           ...
472  Female            Rich  150.533388  77.970932   35  20406.420796
475  Female            Rich  150.717489  70.414545   33  17761.171044
476  Female            Rich  183.783733  95.865257   36  16994.425091
479  Female            Rich  136.390303  80.395418   32  15081.717897
487  Female            Rich  145.317681  43.436630   45  18546.357129

[79 rows x 6 columns]
('Male', 'Middle Class')
    Gender Economic Status      Height      Weight  Age        Income
4     Male    Middle Class  242.785594   72.312758   34  14182.630333
5     Male    Middle Class  212.357599   61.578724   52  15700.149195
25    Male    Middle Class  109.588389   67.071566    7  17518.234045
48    Male    Middle Class  157.312513   81.446512   29  17940.261659
53    Male    Middle Class  140.738483   73.009979   15  12096.052527
..     ...             ...         ...         ...  ...           ...
456   Male    Middle Class  140.609874   76.115080   29  18021.226988
457   Male    Middle Class  148.754073   80.389371   40  10724.131544
461   Male    Middle Class  173.942165   59.414908   29  18071.541336
463   Male    Middle Class  165.616340   56.414562   36  17249.016491
483   Male    Middle Class  200.557498  117.994753   28  19481.042797

[72 rows x 6 columns]
('Male', 'Poor')
    Gender Economic Status      Height     Weight  Age        Income
3     Male            Poor  139.625756  47.526876   41  17112.665822
19    Male            Poor  186.539258  43.446507   28  14834.132815
35    Male            Poor  119.923919  63.556844   29  13779.474031
45    Male            Poor  151.723886  68.825863   27  17535.365846
47    Male            Poor  138.952437  82.620894   29  15575.059241
..     ...             ...         ...        ...  ...           ...
471   Male            Poor  181.090527  93.725084   30  16396.051607
473   Male            Poor  102.930720  53.583708   48  19491.500364
482   Male            Poor  189.903690  45.634899   25  23264.833944
484   Male            Poor  159.300407  77.675019   25  19133.911558
496   Male            Poor  123.539934  87.016845   64  18377.231521

[70 rows x 6 columns]
('Male', 'Rich')
    Gender Economic Status      Height      Weight  Age        Income
8     Male            Rich  151.220185   66.356876   20  13931.548978
9     Male            Rich  152.739256   72.220529   27  22820.255523
14    Male            Rich  153.718918   40.191533   25  23827.651748
22    Male            Rich  175.060984   47.375599   20  15468.724540
31    Male            Rich  174.260018   48.191294   34  21167.060361
..     ...             ...         ...         ...  ...           ...
488   Male            Rich  169.898753   74.610390   40  16886.585144
489   Male            Rich  189.571604   67.333214   38  17575.390642
491   Male            Rich  162.240592   96.059169   23  17531.218119
492   Male            Rich  199.114712   62.540256   24  14669.617357
493   Male            Rich  135.571083  126.362858   42  21270.658356

[99 rows x 6 columns]

In [46]:
double_group.get_group(('Male', 'Rich'))

    Gender Economic Status      Height      Weight  Age        Income
8     Male            Rich  151.220185   66.356876   20  13931.548978
9     Male            Rich  152.739256   72.220529   27  22820.255523
14    Male            Rich  153.718918   40.191533   25  23827.651748
22    Male            Rich  175.060984   47.375599   20  15468.724540
31    Male            Rich  174.260018   48.191294   34  21167.060361
..     ...             ...         ...         ...  ...           ...
488   Male            Rich  169.898753   74.610390   40  16886.585144
489   Male            Rich  189.571604   67.333214   38  17575.390642
491   Male            Rich  162.240592   96.059169   23  17531.218119
492   Male            Rich  199.114712   62.540256   24  14669.617357
493   Male            Rich  135.571083  126.362858   42  21270.658356

[99 rows x 6 columns]